

ERROR_MSG = {

    # TODO 10000-19999 找不到资源
    10001: '商品不存在',
    10002: '商品分类不存在',
    10003: '库存不存在',
    10004: '订单不存在',
    10005: '订单详情不存在',
    10006: '活动不存在',
    10007: '活动商品不存在',
    10008: '平台不存在',
    10009: '入库单不存在',
    10010: '入库单详情不存在',
    10011: '库存调拨不存在',
    10012: '店铺不存在',
    10013: '仓库不存在',
    10014: '支付凭证不存在',
    10016: '支付金额不对',

    # TODO 20000-29999 认证授权错误
    20000: 'Token不存在',
    20001: 'Token过期',
    20002: 'Token非法',
    20003: '认证失败',

    # TODO 30000-39999 资源已存在，重复操作

    # TODO 40000-49999 参数错误
    40001: '同步商品失败',
    40002: '同步入库单失败',
    40003: '提现金额大于账户余额',
    40004: '不支持的账单类型',
    40005: '逾期费用为0',
    40006: '费用不一致',
    40007: '不支持的收入类型',
    40008: '提现金额大于保证金余额',
    40009: 'store key不存在',
    40010: '该店铺需要store key',

    # TODO 50000-59999 操作失败
    50001: '订单审核失败:该订单已审核',
    50002: '订单审核失败:该订单已锁定',
    50003: '订单审核失败:地址非法',
    50004: '订单审核失败:库存不足',
    50005: '账户余额不足，无法生成发货单',


    # TODO 60000-69999 服务器内部错误
    60001: '内部服务请求失败',
    60002: '百度地图获取经纬度失败',
    60003: '百度地图获取距离失败',
    60004: '没有找到快递收费标准',
    60005: '没有找到订单处理收费标准',
    60006: '没有找到仓储收费标准',
    60007: 'Ping ++回调失败'
    
}

